#{{AUTOGENERATED_SCRIPT}}#

set search_path $include_dirs
set link_library " "

# Configure VC Static
set_app_var enable_lint true
set_app_var report_all_hdl_errors true
configure_lint_setup -goal lint_rtl

# Check the design
analyze -format sverilog -vcs "$sources -sverilog"
elaborate $top_module
check_lint

# Generate report
report_violations -verbose -file $report_file -report {sg_moresimple}
exit_on_violation "info" "DB_CANT_LOAD"
