#{{AUTOGENERATED_SCRIPT}}#

proc exit_on_violation {{ignore_severities "info"} {ignore_tags ""}} {
    set violation_tags [get_violation_tags]
    foreach tag $violation_tags {
    	set info [get_tag_info $tag]
        if {$tag in $ignore_tags} {
            continue
        }
        set severity [lindex $info 1]
        if {$severity in $ignore_severities} {
            continue
        }
        error "Violation found (tag: $tag, severity: $severity)"
    }
}

set search_path $include_dirs
set link_library " "

# Configure VC Static
set_app_var enable_lint true
set_app_var report_all_hdl_errors true
configure_lint_setup -goal lint_rtl

# Check the design
analyze -format sverilog -vcs "$sources -sverilog"
elaborate $top_module
check_lint

# Generate report
report_violations -verbose -file $report_file -report {sg_moresimple}
exit_on_violation "info" "DB_CANT_LOAD"
